package main

//位运算
//主要以二进制为主
import (
	"fmt"
)

func main() {
	//正数原码，反码，补码一致
	//负数反码与原码除符号位外其余相反，补码为反码+1
	fmt.Println(2 & 3)
	//先将2，3化成二进制补码，00000010与00000011
	//有0取0，都为1则取1 ==》 00000010，结果为2
	fmt.Println(2 | 3)
	//有1取1，全为0取0 ==》00000011，结果为3
	fmt.Println(2 ^ 3)
	//相同为0，不同为1 ==》 00000001，结果为1
	fmt.Println(-2 ^ 2)
	//先取得最终补码111111110与00000010>>11111100
	//补码转化成原码>>10000100,结果为-4
	a := 1 >> 2
	//二进制00000001将1向右移动2位，结果为0
	b := 1 << 2
	//二进制00000001将1向左移动2位，结果为4
	fmt.Printf("a = %d,b = %d", a, b)
	//>>:低位溢出，位位用符号位不全，0则补0，1则补1
	//<<：符号位不变，用0补全低位
}
